permeability/cylinder-array-in-square-tube/system/createPatchDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object createPatchDict;
}

pointSync false;

patches
(
  {
    name walls;

    patchInfo
    {
      type wall;
    }

    constructFrom patches;
    patches (walls "cyl.*");
  }
);

// vi: set ft=foam et sw=2 ts=2 sts=2:
