permeability/cylinder-array-in-square-tube/system/snappyHexMeshDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers no;


geometry
{
  #include "$FOAM_CASE/cylinders"
};

castellatedMeshControls
{
  maxLocalCells 500000;
  maxGlobalCells 500000;
  minRefinementCells 100;
  nCellsBetweenLevels 1;

  features
  (
  );

  refinementSurfaces
  {
    ".*"
    {
      level (2 2);
    }
  }

  refinementRegions
  {
    "cyl.*"
    {
      mode distance;
      levels ((1e-6 2) (1e-5 1));
    }
  }

  resolveFeatureAngle 80;
  locationInMesh (5e-4 5e-4 5e-4);
  allowFreeStandingZoneFaces true;
}


snapControls
{
  nSmoothPatch 10;
  tolerance 2.0;
  nSolveIter 10;
  nRelaxIter 10;

  nFeatureSnapIter 10;
  implicitFeatureSnap true;
  explicitFeatureSnap false;
  multiRegionFeatureSnap false;
}


addLayersControls
{
  relativeSizes true;

  layers
  {
  }

  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.1;
  nGrow 0;
  featureAngle 60;
  slipFeatureAngle 30;
  nRelaxIter 3;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 90;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
}


// Disabling quality controls
meshQualityControls
{
  maxNonOrtho 180; // 65;
  maxBoundarySkewness -1;  // 20;
  maxInternalSkewness -1;  // 4;
  maxConcave 180;  // 80;
  minVol -1e-30;
  minTetQuality -1e30;  // 1e-30;
  minArea -1;
  minTwist -2;  // 0.02;
  minDeterminant 0.001;
  minFaceWeight 0.02;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
}


debug 0;
mergeTolerance 1e-6;

// vi: set ft=foam et sw=2 ts=2 sts=2:
